yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152k4.h
#define WFE_CR2_EXTI_EV4         WFE_CR2_bit.EXTI_EV4
#define WFE_CR2_EXTI_EV5         WFE_CR2_bit.EXTI_EV5
#define WFE_CR2_EXTI_EV6         WFE_CR2_bit.EXTI_EV6
#define WFE_CR2_EXTI_EV7         WFE_CR2_bit.EXTI_EV7
#define WFE_CR2_EXTI_EVB         WFE_CR2_bit.EXTI_EVB
#define WFE_CR2_EXTI_EVD         WFE_CR2_bit.EXTI_EVD
#define WFE_CR2_EXTI_EVF         WFE_CR2_bit.EXTI_EVF
#define WFE_CR2_ADC1_COMP_EV     WFE_CR2_bit.ADC1_COMP_EV

#define WFE_CR3_TIM3_EV0         WFE_CR3_bit.TIM3_EV0
#define WFE_CR3_TIM3_EV1         WFE_CR3_bit.TIM3_EV1
#define WFE_CR3_TIM4_EV          WFE_CR3_bit.TIM4_EV
#define WFE_CR3_SPI1_EV          WFE_CR3_bit.SPI1_EV
#define WFE_CR3_I2C1_EV          WFE_CR3_bit.I2C1_EV
#define WFE_CR3_USART1_EV        WFE_CR3_bit.USART1_EV
#define WFE_CR3_DMA1CH01_EV      WFE_CR3_bit.DMA1CH01_EV
#define WFE_CR3_DMA1CH23_EV      WFE_CR3_bit.DMA1CH23_EV

#endif

/*-------------------------------------------------------------------------
 *      WFE bit masks
 *-----------------------------------------------------------------------*/
#define MASK_WFE_CR1_TIM2_EV0    0x01
#define MASK_WFE_CR1_TIM2_EV1    0x02
#define MASK_WFE_CR1_TIM1_EV0    0x04
#define MASK_WFE_CR1_TIM1_EV1    0x08
#define MASK_WFE_CR1_EXTI_EV0    0x10
#define MASK_WFE_CR1_EXTI_EV1    0x20
#define MASK_WFE_CR1_EXTI_EV2    0x40
#define MASK_WFE_CR1_EXTI_EV3    0x80

#define MASK_WFE_CR2_EXTI_EV4    0x01
#define MASK_WFE_CR2_EXTI_EV5    0x02
#define MASK_WFE_CR2_EXTI_EV6    0x04
#define MASK_WFE_CR2_EXTI_EV7    0x08
#define MASK_WFE_CR2_EXTI_EVB    0x10
#define MASK_WFE_CR2_EXTI_EVD    0x20
#define MASK_WFE_CR2_EXTI_EVF    0x40
#define MASK_WFE_CR2_ADC1_COMP_EV 0x80

#define MASK_WFE_CR3_TIM3_EV0    0x01
#define MASK_WFE_CR3_TIM3_EV1    0x02
#define MASK_WFE_CR3_TIM4_EV     0x04
#define MASK_WFE_CR3_SPI1_EV     0x08
#define MASK_WFE_CR3_I2C1_EV     0x10
#define MASK_WFE_CR3_USART1_EV   0x20
#define MASK_WFE_CR3_DMA1CH01_EV 0x40
#define MASK_WFE_CR3_DMA1CH23_EV 0x80


/*-------------------------------------------------------------------------
 *      RST register definitions
 *-----------------------------------------------------------------------*/
/* Reset control register */
__IO_REG8    (RST_CR,      0x50B0, __READ_WRITE);
/* Reset status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PORF        : 1;
  unsigned char IWDGF       : 1;
  unsigned char ILLOPF      : 1;
  unsigned char SWIMF       : 1;
  unsigned char WWDGF       : 1;
  unsigned char BORF        : 1;
} __BITS_RST_SR;
#endif
__IO_REG8_BIT(RST_SR,      0x50B1, __READ_WRITE, __BITS_RST_SR);


/*-------------------------------------------------------------------------
 *      RST bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RST_SR_PORF              RST_SR_bit.PORF
#define RST_SR_IWDGF             RST_SR_bit.IWDGF
#define RST_SR_ILLOPF            RST_SR_bit.ILLOPF
#define RST_SR_SWIMF             RST_SR_bit.SWIMF
#define RST_SR_WWDGF             RST_SR_bit.WWDGF
#define RST_SR_BORF              RST_SR_bit.BORF

#endif

/*-------------------------------------------------------------------------
 *      RST bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RST_SR_PORF         0x01
#define MASK_RST_SR_IWDGF        0x02
#define MASK_RST_SR_ILLOPF       0x04
#define MASK_RST_SR_SWIMF        0x08
#define MASK_RST_SR_WWDGF        0x10
#define MASK_RST_SR_BORF         0x20


/*-------------------------------------------------------------------------
 *      PWR register definitions
 *-----------------------------------------------------------------------*/
/* Power control and status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PVDE        : 1;
  unsigned char PLS         : 3;
  unsigned char PVDIEN      : 1;
  unsigned char PVDIF       : 1;
  unsigned char PVDOF       : 1;
} __BITS_PWR_CSR1;
#endif
__IO_REG8_BIT(PWR_CSR1,    0x50B2, __READ_WRITE, __BITS_PWR_CSR1);

/* Power control and status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VREFINTF    : 1;
  unsigned char ULP         : 1;
  unsigned char FWU         : 1;
} __BITS_PWR_CSR2;
#endif
__IO_REG8_BIT(PWR_CSR2,    0x50B3, __READ_WRITE, __BITS_PWR_CSR2);


/*-------------------------------------------------------------------------
 *      PWR bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define PWR_CSR1_PVDE            PWR_CSR1_bit.PVDE
#define PWR_CSR1_PLS             PWR_CSR1_bit.PLS
#define PWR_CSR1_PVDIEN          PWR_CSR1_bit.PVDIEN
#define PWR_CSR1_PVDIF           PWR_CSR1_bit.PVDIF
#define PWR_CSR1_PVDOF           PWR_CSR1_bit.PVDOF

#define PWR_CSR2_VREFINTF        PWR_CSR2_bit.VREFINTF
#define PWR_CSR2_ULP             PWR_CSR2_bit.ULP
#define PWR_CSR2_FWU             PWR_CSR2_bit.FWU

#endif

/*-------------------------------------------------------------------------
 *      PWR bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PWR_CSR1_PVDE       0x01
#define MASK_PWR_CSR1_PLS        0x0E
#define MASK_PWR_CSR1_PVDIEN     0x10
#define MASK_PWR_CSR1_PVDIF      0x20
#define MASK_PWR_CSR1_PVDOF      0x40

#define MASK_PWR_CSR2_VREFINTF   0x01
#define MASK_PWR_CSR2_ULP        0x02
#define MASK_PWR_CSR2_FWU        0x04


/*-------------------------------------------------------------------------
 *      CLK register definitions
 *-----------------------------------------------------------------------*/
/* Clock master divider register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CKM         : 3;
} __BITS_CLK_CKDIVR;
#endif
__IO_REG8_BIT(CLK_CKDIVR,  0x50C0, __READ_WRITE, __BITS_CLK_CKDIVR);

/* Clock RTC register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RTCSWBSY    : 1;
  unsigned char RTCSEL0     : 1;
  unsigned char RTCSEL1     : 1;
  unsigned char RTCSEL2     : 1;
  unsigned char RTCSEL3     : 1;
  unsigned char RTCDIV0     : 1;
  unsigned char RTCDIV1     : 1;
  unsigned char RTCDIV2     : 1;
} __BITS_CLK_CRTCR;
#endif
__IO_REG8_BIT(CLK_CRTCR,   0x50C1, __READ_WRITE, __BITS_CLK_CRTCR);

/* Internal clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSION       : 1;
  unsigned char HSIRDY      : 1;
  unsigned char LSION       : 1;
  unsigned char LSIRDY      : 1;
  unsigned char SAHALT      : 1;
  unsigned char FHWU        : 1;
  unsigned char BEEPAHALT   : 1;
} __BITS_CLK_ICKCR;
#endif
__IO_REG8_BIT(CLK_ICKCR,   0x50C2, __READ_WRITE, __BITS_CLK_ICKCR);

