yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152k4.h
/* TIM1 Repetition counter register */
__IO_REG8    (TIM1_RCR,    0x52C5, __READ_WRITE);
/* TIM1 Capture/Compare register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR18       : 1;
  unsigned char CCR19       : 1;
  unsigned char CCR110      : 1;
  unsigned char CCR111      : 1;
  unsigned char CCR112      : 1;
  unsigned char CCR113      : 1;
  unsigned char CCR114      : 1;
  unsigned char CCR115      : 1;
} __BITS_TIM1_CCR1H;
#endif
__IO_REG8_BIT(TIM1_CCR1H,  0x52C6, __READ_WRITE, __BITS_TIM1_CCR1H);

/* TIM1 Capture/Compare register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM1_CCR1L;
#endif
__IO_REG8_BIT(TIM1_CCR1L,  0x52C7, __READ_WRITE, __BITS_TIM1_CCR1L);

/* TIM1 Capture/Compare register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR28       : 1;
  unsigned char CCR29       : 1;
  unsigned char CCR210      : 1;
  unsigned char CCR211      : 1;
  unsigned char CCR212      : 1;
  unsigned char CCR213      : 1;
  unsigned char CCR214      : 1;
  unsigned char CCR215      : 1;
} __BITS_TIM1_CCR2H;
#endif
__IO_REG8_BIT(TIM1_CCR2H,  0x52C8, __READ_WRITE, __BITS_TIM1_CCR2H);

/* TIM1 Capture/Compare register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR20       : 1;
  unsigned char CCR21       : 1;
  unsigned char CCR22       : 1;
  unsigned char CCR23       : 1;
  unsigned char CCR24       : 1;
  unsigned char CCR25       : 1;
  unsigned char CCR26       : 1;
  unsigned char CCR27       : 1;
} __BITS_TIM1_CCR2L;
#endif
__IO_REG8_BIT(TIM1_CCR2L,  0x52C9, __READ_WRITE, __BITS_TIM1_CCR2L);

/* TIM1 Capture/Compare register 3 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR38       : 1;
  unsigned char CCR39       : 1;
  unsigned char CCR310      : 1;
  unsigned char CCR311      : 1;
  unsigned char CCR312      : 1;
  unsigned char CCR313      : 1;
  unsigned char CCR314      : 1;
  unsigned char CCR315      : 1;
} __BITS_TIM1_CCR3H;
#endif
__IO_REG8_BIT(TIM1_CCR3H,  0x52CA, __READ_WRITE, __BITS_TIM1_CCR3H);

/* TIM1 Capture/Compare register 3 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR30       : 1;
  unsigned char CCR31       : 1;
  unsigned char CCR32       : 1;
  unsigned char CCR33       : 1;
  unsigned char CCR34       : 1;
  unsigned char CCR35       : 1;
  unsigned char CCR36       : 1;
  unsigned char CCR37       : 1;
} __BITS_TIM1_CCR3L;
#endif
__IO_REG8_BIT(TIM1_CCR3L,  0x52CB, __READ_WRITE, __BITS_TIM1_CCR3L);

/* TIM1 Capture/Compare register 4 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR48       : 1;
  unsigned char CCR49       : 1;
  unsigned char CCR410      : 1;
  unsigned char CCR411      : 1;
  unsigned char CCR412      : 1;
  unsigned char CCR413      : 1;
  unsigned char CCR414      : 1;
  unsigned char CCR415      : 1;
} __BITS_TIM1_CCR4H;
#endif
__IO_REG8_BIT(TIM1_CCR4H,  0x52CC, __READ_WRITE, __BITS_TIM1_CCR4H);

/* TIM1 Capture/Compare register 4 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR40       : 1;
  unsigned char CCR41       : 1;
  unsigned char CCR42       : 1;
  unsigned char CCR43       : 1;
  unsigned char CCR44       : 1;
  unsigned char CCR45       : 1;
  unsigned char CCR46       : 1;
  unsigned char CCR47       : 1;
} __BITS_TIM1_CCR4L;
#endif
__IO_REG8_BIT(TIM1_CCR4L,  0x52CD, __READ_WRITE, __BITS_TIM1_CCR4L);

/* TIM1 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char OSSR        : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM1_BKR;
#endif
__IO_REG8_BIT(TIM1_BKR,    0x52CE, __READ_WRITE, __BITS_TIM1_BKR);

/* TIM1 dead-time register */
__IO_REG8    (TIM1_DTR,    0x52CF, __READ_WRITE);
/* TIM1 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char OIS1N       : 1;
  unsigned char OIS2        : 1;
  unsigned char OIS2N       : 1;
  unsigned char OIS3        : 1;
  unsigned char OIS3N       : 1;
} __BITS_TIM1_OISR;
#endif
__IO_REG8_BIT(TIM1_OISR,   0x52D0, __READ_WRITE, __BITS_TIM1_OISR);

/* DMA1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DBA         : 5;
} __BITS_TIM1_DCR1;
#endif
__IO_REG8_BIT(TIM1_DCR1,   0x52D1, __READ_WRITE, __BITS_TIM1_DCR1);

/* TIM1 DMA1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DBL         : 5;
} __BITS_TIM1_DCR2;
#endif
__IO_REG8_BIT(TIM1_DCR2,   0x52D2, __READ_WRITE, __BITS_TIM1_DCR2);

/* TIM1 DMA1 address for burst mode */
__IO_REG8    (TIM1_DMA1R,  0x52D3, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM1_CR1_CEN             TIM1_CR1_bit.CEN
#define TIM1_CR1_UDIS            TIM1_CR1_bit.UDIS
#define TIM1_CR1_URS             TIM1_CR1_bit.URS
#define TIM1_CR1_OPM             TIM1_CR1_bit.OPM
#define TIM1_CR1_DIR             TIM1_CR1_bit.DIR
#define TIM1_CR1_CMS             TIM1_CR1_bit.CMS
#define TIM1_CR1_ARPE            TIM1_CR1_bit.ARPE

#define TIM1_CR2_CCPC            TIM1_CR2_bit.CCPC
#define TIM1_CR2_COMS            TIM1_CR2_bit.COMS
#define TIM1_CR2_CCDS            TIM1_CR2_bit.CCDS
#define TIM1_CR2_MMS             TIM1_CR2_bit.MMS
#define TIM1_CR2_TI1S            TIM1_CR2_bit.TI1S

